"""
Создайте матрицу размерностью 12 x 12,транспонируйте её,
возведите каждый элемент матрицы в квадрат и умножьте на 2.
Вычтите из данной матрицы единичную матрицу
и распечатайте результат на консоль.

"""
import numpy

print('Матрица 12х12:')
print('Транспонированная матрица:')
print('Транспонированная матрица, значения которой возведены в квадрат:')
print('Транспонированная матрица, значения которой возведены в квадрат и умножены на 2:')
